/*1. Продумайте структуру класса Кот. Какие поля и методы будут актуальны для
приложения, которое является
а) информационной системой ветеринарной клиники
б) архивом выставки котов
в) информационной системой Театра кошек Ю. Д. Куклачёва
Можно записать в текстовом виде, не обязательно реализовывать в java.


А. Ветеринарная клиника.

    Поля:
    Кличка (name)
    Год рождения (age)
    Порода (breed)
    Номер пасспорта (ID passport)
    Окрас (color)
    Владелец (owner)
    Пол (sex)
    Список прививок (vactination)
    История посещений (visit history)

    Методы:
    Геттеры: getName(),getBreed(),getColor() ...
    Сеттеры: setName(),setBreed(),setColor() ...
    Добавить прививку addVaccination()
    Добавить посещение addVisit()
    ...


Б. Выставка котов.

    Поля:
    Кличка (name)
    Год рождения (age)
    Порода (breed)
    Окрас (color)
    Владелец (owner)
    Пол (sex)
    Награды(awards)

    Методы:
    Геттеры: getName(),getBreed(),getColor() ...
    Сеттеры: setName(),setBreed(),setColor() ...
    Добавить награду addAwards()



В. Информационная система Театра кошек Ю. Д. Куклачёва

    Поля:
    Кличка (name)
    Год рождения (age)
    Порода (breed)
    Окрас (color)
    Пол (sex)
    Дрессировщик (trainer)
    Навыки (skills)
    Список прививок (vactination)
    Роли (roles)
    Любимое лакомства (delicacies)

    Методы:
    Геттеры: getName(),getBreed(),getColor() ...
    Сеттеры: setName(),setBreed(),setColor() ...
    Добавить роль addRole()
    Добавить навык addSkill()
    Добавить лакомства addDelicacy()

 */
